import BaseSurveyStrategy from "../baseSurveyStrategy.js";
import Question from "../question.js";

export default class CervixSurvey extends BaseSurveyStrategy {
  constructor() {
    super();
    this.createQuestions();
    this.createScores();
  }

  createQuestions() {
    this.questions = new Map([
      [1, new Question("Место проживания:", ["Город", "Село"])],
      [
        2,
        new Question("Возраст:", [
          "20-29",
          "30-39",
          "40-49",
          "50-59",
          "60-69",
          "70+",
        ])
      ],
      [
        3,
        new Question("Национальность:", [
          "Ингушка",
          "Чеченка",
          "Русская",
          "Другая",
        ])
      ],
      [4, new Question("Образование:", ["Высшее", "Среднее"])],
      [
        5,
        new Question("Профессия:", [
          "Учитель",
          "Обучение в высшем образовательном учреждении",
          "Домохозяйка",
          "Другая профессия",
        ])
      ],
      [
        6,
        new Question("С какого возраста замужем:", [
          "с 15 лет",
          "с 16 лет",
          "с 17 лет",
          "с 18 лет",
          "с 19 лет",
          "с 20 лет",
          "с 21 лет",
          "с 22 лет",
          "с 23 лет",
          "с 24 лет",
          "с 25 лет и более",
        ])
      ],
      [
        7,
        new Question(
          "Жалобы (можно указать несколько вариантов):",
          [
            "Жжение в половых путях",
            "Боли внизу живота",
            "Кровотечение из половых путей",
            "Головокружение, слабость",
            "Другие",
          ],
          true
        ),
      ],
      [
        8,
        new Question("Тип менструации:", [
          "Идеальные",
          "Антепонирующие",
          "Постпонирующие",
          "Нерегулярные",
        ])
      ],
      [
        9,
        new Question("Продолжительность менструаций:", [
          "Нормальная (3–6 дней)",
          "Длительная (более 6 дней)",
          "Короткая (до 2 дней)",
        ])
      ],
      [
        10,
        new Question("Характер менструаций:", [
          "Умеренный",
          "Скудный",
          "Обильный",
        ])
      ],
      [
        11,
        new Question("Дисфункциональное кровотечение в климактерии:", [
          "Да",
          "Нет",
          "Нет менопаузы",
        ])
      ],
      [
        12,
        new Question("Возраст наступления менопаузы:", [
          "До 45 лет",
          "До 50-59 лет",
          "нет менопаузы",
        ])
      ],
      [
        13,
        new Question("Кровянистые выделения в менопаузе:", [
          "Да",
          "Нет",
          "Нет менопаузы",
        ])
      ],
      [
        14,
        new Question("Развитие молочных желез:", [
          "До 11 лет",
          "11-12 лет",
          "13-14 лет",
          "Нет информации",
        ])
      ],
      [
        15,
        new Question("Рост волос на лобке:", [
          "До 11 лет",
          "11-12 лет",
          "13-14 лет",
          "Нет информации",
        ])
      ],
      [
        16,
        new Question("Рост волос в подмышечной области:", [
          "До 11 лет",
          "11-12 лет",
          "Старше",
          "Нет информации",
        ])
      ],
      [
        17,
        new Question(
          "Отложение жировой ткани на бедрах и в передней брюшной стенке:",
          ["До 10 лет", "10-12 лет", "Старше", "Нет информации"]
        ),
      ],
      [
        18,
        new Question("С какого возраста появилось либидо:", [
          "До 13 лет",
          "14-15 лет",
          "16 лет и старше",
          "нет информации",
        ])
      ],
      [
        19,
        new Question("Характер либидо:", [
          "Нормальный",
          "Пониженный",
          "Повышенный",
          "Фригидность",
        ])
      ],
      [
        20,
        new Question("Применение химических противозачаточных средств", [
          "Да",
          "Нет",
          "Нет информации",
        ])
      ],
      [
        21,
        new Question("Регулярность половой жизни", [
          "Регулярная",
          "Нерегулярная",
        ])
      ],
      [
        22,
        new Question("Количество беременностей:", [
          "До 2-х",
          "До 4-х",
          "5-9",
          "Более 10",
          "Не было родов",
        ])
      ],
      [
        23,
        new Question("Количество абортов:", [
          "До 3-х",
          "4-5 абортов",
          "Более 5",
          "Не было абортов",
        ])
      ],
      [
        24,
        new Question("Возраст при первом аборте:", [
          "До 18 лет",
          "19-30 лет",
          "Старше 30",
          "Нет информации",
        ])
      ],
      [
        25,
        new Question("Роды, осложненные травмой шейки матки:", [
          "Да",
          "Нет",
          "Нет информации",
        ])
      ],
      [
        26,
        new Question("Воспаление придатков матки:", [
          "Да",
          "Нет",
          "Нет информация",
        ])
      ],
      [27, new Question("Воспаление матки:", ["Да", "Нет", "Нет информация"])],
      [
        28,
        new Question("Перенесенные гинекологические операции:", ["Да", "Нет"])
      ],
      [29, new Question("Ожирение:", ["Да", "Нет", "Нет информация"])],
      [30, new Question("Диабет:", ["Да", "Нет", "Нет информация"])],
      [
        31,
        new Question(
          "Наличие злокачественных опухолей у родственников (1-й линии) (можно указать несколько вариантов):",
          [
            "Половые органы",
            "Легкие",
            "Молочные железы",
            "ЖКТ",
            "Нет опухоли",
            "Нет информация",
          ],
          true
        ),
      ],
      [
        32,
        new Question(
          "Наличие злокачественных опухолей у родственников (2-й линии) (можно указать несколько вариантов):",
          ["Легкие", "Молочные железы", "ЖКТ", "Нет опухоли", "Нет информация"],
          true
        ),
      ],
      [
        33,
        new Question("Характер пищи:", [
          "Мясная",
          "Рыбная",
          "Растительная",
          "Молочная",
          "Смешанная",
        ])
      ],
      [
        34,
        new Question(
          "Последствия психологической травмы (можно указать несколько вариантов):",
          [
            "Раздражительность",
            "Плаксивость",
            "Апатия",
            "Бессоница",
            "Другие",
            "Нет",
          ],
          true
        ),
      ],
      [
        35,
        new Question(
          "Состояние нервной системы (можно указать несколько вариантов):",
          [
            "Кратковременная потеря памяти",
            "Долговременная потеря памяти",
            "Когнитивные нарушения (умственные способности)",
            "Состояние аффекта (стресс)",
            "Нет",
          ],
          true
        ),
      ],
      [
        36,
        new Question(
          "Хронические болезни (можно указать несколько вариантов):",
          ["Тонзиллит", "Другие", "Нет"],
          true
        )
      ]
    ]);
  }

  createScores() {
    this.scores = new Map([
      [1, [-0.72, -0.52]],
      [2, [-5.59, -1.65, 2.1, 3.29, 3.29, 0.0]],
      [3, [-0.43, 3.16, 0.0, 0.0]],
      [4, [-3.04, 1.44]],
      [5, [-3.05, -5.02, 2.0, -3.59]],
      [6, [0.0, 0.0, 0.0, 1.62, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -4.2]],
      [7, [-3.73, 1.18, 3.54, -1.11, 0.0]],
      [8, [-1.08, 0.0, 0.0, 2.55]],
      [9, [-0.82, 2.26, 0.0]],
      [10, [-1.05, 0.0, 2.3]],
      [11, [5.61, 0.0, 0.0]],
      [12, [3.47, 5.18, -0.19]],
      [13, [5.78, 0.0, 0.0]],
      [14, [1.48, -1.91, 0.0, 0.0]],
      [15, [1.29, -3.09, 0.0, 0.0]],
      [16, [-1.88, 0.9, 0.0, 0.0]],
      [17, [-5.1, 3.37, 0.0, 0.0]],
      [18, [3.79, 0.0, -2.4, 0.0]],
      [19, [-0.58, 2.75, 0.0, 0.0]],
      [20, [2.32, 0.0, 0.0]],
      [21, [-0.87, 1.15]],
      [22, [-2.62, 0.0, 2.89, 4.29, 0.0]],
      [23, [1.24, 0.0, -6.39, 0.0]],
      [24, [0.0, 1.48, 0.0, 0.0]],
      [25, [3.58, 0.0, 0.0]],
      [26, [1.25, 0.0, 0.0]],
      [27, [1.65, 0.0, 0.0]],
      [28, [3.98, 0.0]],
      [29, [2.68, 0.0, 0.0]],
      [30, [-4.05, 0.0, 0.0]],
      [31, [4.81, 5.21, -1.69, 1.57, -3.99, 0.0]],
      [32, [2.2, 5.54, 3.03, 0.0, 0.0]],
      [33, [2.7, 3.33, 0.0, 0.0, -0.81]],
      [34, [0.26, 1.61, 2.41, 2.11, 0.0, 0.0]],
      [35, [1.13, -2.34, 0.0, 1.52, 0.0]],
      [36, [0.0, 4.08, 0.0]]
    ]);
  }

  getTitle() {return "Опрос о шейки матки";}
}
