import BaseSurveyStrategy from "../baseSurveyStrategy.js";
import Question from "../question.js";

export default class MammaryGlandsSurvey extends BaseSurveyStrategy {
  constructor() {
    super();
    this.createQuestions();
    this.createScores();
  }

createQuestions() {
  this.questions = new Map([
    [1, new Question("Место проживания:", ["Город", "Село"])],
    [2, new Question("Возраст:", [
      "20-29",
      "30-39",
      "40-49",
      "50-59",
      "60-69",
      "70+",
    ])],
    [3, new Question("Национальность:", [
      "Ингушка",
      "Чеченка",
      "Русская",
      "Другая",
    ])],
    [4, new Question("Образование:", ["Высшее", "Среднее"])],
    [5, new Question("Профессия:", [
      "Учитель",
      "Обучение в высшем образовательном учреждении",
      "Обучение в среднем образовательном учреждении",
      "Домохозяйка",
      "Инженер",
      "Медицинский работник",
      "Другая профессия",
    ])],
    [6, new Question("С какого возраста замужем:", [
      "до 18 лет",
      "с 19 лет",
      "с 20 лет",
      "с 21 лет",
      "с 22 лет",
      "с 23 лет",
      "с 24 лет",
      "с 25 лет и более",
    ])],
    [7, new Question("Жалобы (можно указать несколько вариантов):", [
      "Зуд в половых путях",
      "Жжение в половых путях",
      "Боли внизу живота",
      "Бели",
      "Кровотечение из половых путей",
      "Головокружение, слабость",
      "Другие",
    ], true)],
    [8, new Question("С какого возраста начались менструации:", [
      "Нет информации",
      "с 12–14 лет",
      "с 15-17 лет",
    ])],
    [9, new Question("Тип менструации:", [
      "Идеальные",
      "Антепонирующие",
      "Постпонирующие",
      "Нерегулярные",
    ])],
    [10, new Question("Ювенильные кровотечения:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [11, new Question("Аномальные кровотечения в перименопаузе:", [
      "Да",
      "Нет",
      "Нет менопаузы",
    ])],
    [12, new Question("Возраст наступления менопаузы:", [
      "До 45 лет",
      "46-49 лет",
      "до 50-59 лет",
      "нет менопаузы",
    ])],
    [13, new Question("Развитие молочных желез:", [
      "До 11 лет",
      "11-12 лет",
      "13-14 лет",
      "Нет информации",
    ])],
    [14, new Question("Рост волос на лобке:", [
      "До 11 лет",
      "11-12 лет",
      "13-14 лет",
      "Нет информации",
    ])],
    [15, new Question("Рост волос в подмышечной области:", [
      "До 11 лет",
      "11-12 лет",
      "Старше",
      "Нет информации",
    ])],
    [16, new Question("Отложение жировой ткани на бедрах и в передней брюшной стенке:", [
      "До 10 лет",
      "10-12 лет",
      "13-16 лет",
      "Нет информации",
    ])],
    [17, new Question("С какого возраста появилось либидо:", [
      "До 13 лет",
      "14-15 лет",
      "16 лет и старше",
      "нет информации",
    ])],
    [18, new Question("С какого возраста начало половой жизни:", [
      "До 16 лет",
      "16-18 лет",
      "Cтарше",
      "Не было половой жизни",
    ])],
    [19, new Question("Применение противозачаточных средств:", [
      "Не предохраняюсь",
      "Гормональное",
      "Химическое",
      "Механическое",
      "По циклу",
      "Прерванный половой акт",
    ])],
    [20, new Question("Регулярность половой жизни:", [
      "Регулярная",
      "Нерегулярная",
      "Нет половой жизни",
    ])],
    [21, new Question("Бесплодие:", [
      "Первичное",
      "Вторичное",
      "Нет бесплодия",
    ])],
    [22, new Question("Количество беременностей:", [
      "До 2-х",
      "До 4-х",
      "5-9",
      "Более 10",
      "Не было родов",
    ])],
    [23, new Question("Возраст при первых родах:", [
      "До 30 лет",
      "Старше 30 лет",
    ])],
    [24, new Question("Количество абортов:", [
      "До 3-х",
      "4-5 абортов",
      "Более 5",
      "Не было абортов",
    ])],
    [25, new Question("Возраст при первом аборте:", [
      "До 18 лет",
      "19-30 лет",
      "Старше 30",
      "Нет информации",
    ])],
    [26, new Question("Рождение крупного плода (более 4000):", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [27, new Question("Роды, осложненные травмой шейки матки:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [28, new Question("Киста яичника:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [29, new Question("Перенесенные гинекологические операции:", [
      "Да",
      "Нет",
    ])],
    [30, new Question("Ожирение:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [31, new Question("Гипертоническая болезнь:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [32, new Question("Инфекционный гепатит:", [
      "Да",
      "Нет",
      "Нет информации",
    ])],
    [33, new Question("Наличие злокачественных опухолей у родственников (1-й линии) (можно указать несколько вариантов):", [
      "Женские половые органы",
      "Мужские половые органы",
      "Легкие",
      "Молочные железы",
      "ЖКТ",
      "Нет опухоли",
      "Нет информации",
    ], true)],
    [34, new Question("Наличие злокачественных опухолей у родственников (2-й линии) (можно указать несколько вариантов):", [
      "Половые органы",
      "Легкие",
      "Молочные железы",
      "ЖКТ",
      "Нет опухоли",
      "Нет информации",
    ], true)],
    [35, new Question("Характер пищи:", [
      "Мясная",
      "Рыбная",
      "Растительная",
      "Молочная",
      "Смешанная",
    ])],
    [36, new Question("Последствия психологической травмы (можно указать несколько вариантов):", [
      "Раздражительность",
      "Плаксивость",
      "Апатия",
      "Навязчивые явления",
      "Другое",
      "Нет",
    ], true)],
    [37, new Question("Состояние нервной системы (можно указать несколько вариантов):", [
      "Кратковременная потеря памяти",
      "Долговременная потеря памяти",
      "Когнитивные нарушения (умственные способности)",
      "Аффективные реакции (раздражительность, плаксивость, эмоциональная лабильность)",
      "Другое",
      "Нет",
    ], true)],
    [38, new Question("Хронические болезни (можно указать несколько вариантов):", [
      "Аднексит",
      "Эндоцервицит",
      "Кольпит",
      "Колит",
      "Другие",
      "Нет",
    ], true)],
  ]);
}

  createScores() {
    this.scores = new Map([
      [1, [-0.3, 0.3]],
      [2, [-3.8, 0.0, 1.3, 2.6, 0.0, 0.0]],
      [3, [-0.3, 2.7, -3.5, 0.0]],
      [4, [0.0, 0.9]],
      [5, [-2.1, -3.8, -7.1, 1.9, -4.7, -4.6, 0.0]],
      [6, [1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -1.6]],
      [7, [-7.2, -6.5, 0.6, -8.5, -2.2, -0.95, 0.0]],
      [8, [0.0, 0.6, -4.5]],
      [9, [-0.7, 0.0, 0.0, 1.5]],
      [10, [5.8, 0.0, 0.0]],
      [11, [6.8, 0.0, 0.0]],
      [12, [0.0, 0.0, 4.9, -1.0]],
      [13, [5.1, 1.03, -2.12, 0.0]],
      [14, [3.79, 0.78, -2.35, 0.0]],
      [15, [-1.4, 1.2, 0.0, 0.0]],
      [16, [0.0, 2.5, 1.1, 0.0]],
      [17, [2.5, 1.1, -1.2, 0.0]],
      [18, [-4.4, -1.7, 0.0, 0.0]],
      [19, [0.0, 1.4, -3.3, -3.9, 0.0, 0.0]],
      [20, [-0.9, 1.2, 1.25]],
      [21, [3.13, 0.0, 0.0]],
      [22, [-1.8, 0.0, 2.6, 2.2, 0.0]],
      [23, [0.33, -3.18]],
      [24, [0.0, 0.0, -7.4, 1.5]],
      [25, [0.0, 2.34, 0.0, 0.0]],
      [26, [1.3, 0.0, 0.0]],
      [27, [1.9, 0.0, 0.0]],
      [28, [1.9, 0.0, 0.0]],
      [29, [1.5, 0.0, 0.0]],
      [30, [2.9, 0.0, 0.0]],
      [31, [2.8, 0.0, 0.0]],
      [32, [-2.35, 0.0, 0.0]],
      [33, [5.08, 2.63, 0.0, 1.13, 0.92, -4.38, 0.01]],
      [34, [3.7, 1.94, 4.5, 0.21, -2.86, 0.35]],
      [35, [0.0, 1.2, 0.0, 0.0, 0.0]],
      [36, [-0.14, 1.2, 1.9, 1.2, 0.0, 0.0]],
      [37, [0.2, -0.6, 0.0, 2.6, 0.0, 0.0]],
      [38, [1.1, -3.5, 2.6, -1.74, 0.0, 0.0]],
    ]);
  }

  getTitle() {return "Опрос о молочных железах";}
}
