import BaseSurveyStrategy from "../baseSurveyStrategy.js";
import Question from "../question.js";

export default class OvariesSurvey extends BaseSurveyStrategy {
  constructor() {
    super();
    this.createQuestions();
    this.createScores();
  }

  createQuestions() {
    this.questions = new Map([
      [1, new Question("Место проживания:", ["Город", "Село"])],
      [
        2,
        new Question("Возраст:", [
          "20-29",
          "30-39",
          "40-49",
          "50-59",
          "60-69",
          "70+",
        ]),
      ],
      [
        3,
        new Question("Национальность:", [
          "Ингушка",
          "Чеченка",
          "Русская",
          "Другая",
        ]),
      ],
      [4, new Question("Образование:", ["Высшее", "Среднее"])],
      [
        5,
        new Question("Профессия:", [
          "Учитель",
          "Обучение в высшем образовательном учреждении",
          "Домохозяйка",
          "Медицинский работник",
          "Другая профессия",
        ]),
      ],
      [
        6,
        new Question("Семейное положение:", [
          "Не замужем",
          "Замужем",
          "Вдова",
          "Разведенная",
        ]),
      ],
      [
        7,
        new Question("С какого возраста замужем:", [
          "с 15 лет",
          "с 16 лет",
          "с 17 лет",
          "с 18 лет",
          "с 19 лет",
          "с 20 лет",
          "с 21 лет",
          "с 22 лет",
          "с 23 лет",
          "с 24 лет",
          "с 25 лет и более",
        ]),
      ],
      [
        8,
        new Question("С какого возраста начались менструации:", [
          "Нет информации",
          "с 12–14 лет",
          "с 15-17 лет",
        ]),
      ],
      [
        9,
        new Question("Тип менструации:", [
          "Идеальные",
          "Антепонирующие",
          "Постпонирующие",
          "Нерегулярные",
        ]),
      ],
      [
        10,
        new Question("Продолжительность менструаций:", [
          "Нормальная (3–6 дней)",
          "Длительная (более 6 дней)",
          "Короткая (до 2 дней)",
        ]),
      ],
      [
        11,
        new Question("Характер менструаций:", [
          "Умеренный",
          "Скудный",
          "Обильный",
        ]),
      ],
      [
        12,
        new Question("Ювенильные кровотечения:", [
          "Да",
          "Нет",
          "Нет информации",
        ]),
      ],
      [
        13,
        new Question("Аномальные кровотечения в перименопаузе:", [
          "Да",
          "Нет",
          "Нет менопаузы",
        ]),
      ],
      [
        14,
        new Question("Кровянистые выделения в менопаузе:", [
          "Да",
          "Нет",
          "Нет менопаузы",
        ]),
      ],
      [
        15,
        new Question("Возраст наступления менопаузы:", [
          "До 45 лет",
          "До 50-59 лет",
          "нет менопаузы",
        ]),
      ],
      [
        16,
        new Question("Рост волос в подмышечной области:", [
          "До 13 лет",
          "13-16 лет",
          "Нет информации",
        ]),
      ],
      [
        17,
        new Question(
          "Отложение жировой ткани на бедрах и в передней брюшной стенке:",
          ["До 10 лет", "10-12 лет", "13-16 лет", "Нет информации"]
        ),
      ],
      [
        18,
        new Question("С какого возраста появилось либидо:", [
          "До 13 лет",
          "14-15 лет",
          "16 лет и старше",
          "нет информации",
        ]),
      ],
      [
        19,
        new Question("Характер либидо:", [
          "Нормальный",
          "Пониженный",
          "Повышенный",
          "Фригидность",
        ]),
      ],
      [
        20,
        new Question("С какого возраста начало половой жизни:", [
          "До 16 лет",
          "16-18 лет",
          "19 лет и старше",
          "Не было половой жизни",
        ]),
      ],
      [
        21,
        new Question("Применение противозачаточных средств:", [
          "Не предохраняюсь",
          "Химический метод",
          "Другой способ",
        ]),
      ],
      [
        22,
        new Question("Регулярность половой жизни:", [
          "Регулярная",
          "Нерегулярная",
          "Нет половой жизни",
        ]),
      ],
      [
        23,
        new Question("Бесплодие:", ["Первичное", "Вторичное", "Нет бесплодия"]),
      ],
      [
        24,
        new Question("Количество беременностей:", [
          "До 4-х",
          "5-9",
          "Более 10",
          "Не было родов",
        ]),
      ],
      [
        25,
        new Question("Количество абортов:", [
          "До 3-х",
          "4-5 абортов",
          "Более 5",
          "Не было абортов",
        ]),
      ],
      [
        26,
        new Question("Возраст при первом аборте:", [
          "До 18 лет",
          "19-30 лет",
          "Старше 30",
          "Нет информации",
        ]),
      ],
      [
        27,
        new Question(
          "Жалобы (можно указать несколько вариантов):",
          [
            "Головокружение, слабость",
            "Отсутствие аппетита",
            "Боли внизу живота",
            "Жжение в половых путей",
            "Другие",
          ],
          true
        ),
      ],
      [28, new Question("Воспаление матки:", ["Да", "Нет", "Нет информации"])],
      [29, new Question("Киста яичника:", ["Да", "Нет", "Нет информации"])],
      [
        30,
        new Question("Перенесенные гинекологические операции:", ["Да", "Нет"]),
      ],
      [31, new Question("Ожирение:", ["Да", "Нет", "Нет информации"])],
      [
        32,
        new Question("Гипертоническая болезнь:", [
          "Да",
          "Нет",
          "Нет информации",
        ]),
      ],
      [
        33,
        new Question(
          "Хронические болезни (можно указать несколько вариантов):",
          ["Тонзиллит", "Эндоцервицит", "Кольпит", "Другие", "Нет"],
          true
        ),
      ],
      [
        34,
        new Question(
          "Наличие злокачественных опухолей у родственников (1-й линии) (можно указать несколько вариантов):",
          [
            "Половые органы",
            "Легкие",
            "Молочные железы",
            "ЖКТ",
            "Нет опухоли",
            "Нет информации",
          ],
          true
        ),
      ],
      [
        35,
        new Question(
          "Наличие злокачественных опухолей у родственников (2-й линии) (можно указать несколько вариантов):",
          [
            "Половые органы",
            "Легкие",
            "Молочные железы",
            "ЖКТ",
            "Нет опухоли",
            "Нет информации",
          ],
          true
        ),
      ],
      [
        36,
        new Question("Характер пищи:", [
          "Мясная",
          "Рыбная",
          "Растительная",
          "Молочная",
          "Смешанная",
        ]),
      ],
      [
        37,
        new Question(
          "Последствия психологической травмы (можно указать несколько вариантов):",
          ["Раздражительность", "Плаксивость", "Апатия", "Другое", "Нет"],
          true
        ),
      ],
      [
        38,
        new Question("Нет опухоли у родственников 1-й и 2-й линии:", [
          "Нету",
          "Есть",
        ]),
      ],
      [
        39,
        new Question(
          "Состояние нервной системы (можно указать несколько вариантов):",
          [
            "Кратковременная потеря памяти",
            "Долговременная потеря памяти",
            "Когнитивные нарушения (умственные способности)",
            "Аффективные реакции (раздражительность, плаксивость, эмоциональная лабильность)",
          ],
          true
        ),
      ],
    ]);
  }

  createScores() {
    this.scores = new Map([
      [1, [-0.65, 0.55]],
      [2, [-5.1, -1.95, 1.75, 2.73, 3.82, 5.21]],
      [3, [0.0, 2.35, 0.0, 0.0]],
      [4, [0.0, 1.51]],
      [5, [-2.08, 1.82, 2.04, -6.39, -3.25]],
      [6, [2.21, -0.37, 2.26, 0.0]],
      [7, [1.48, 1.48, 1.48, 1.48, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]],
      [8, [0.0, -0.54, -4.65]],
      [9, [-1.13, 0.0, 0.0, 2.58]],
      [10, [-0.73, 2.15, 0.0]],
      [11, [-1.12, 0.0, 2.3]],
      [12, [4.11, 0.0, 0.0]],
      [13, [6.89, 0.0, 0.0]],
      [14, [4.5, 0.0, 0.0]],
      [15, [3.73, 5.63, -1.78]],
      [16, [2.12, -5.47, 0.0]],
      [17, [0.0, 0.0, 1.66, 0.0]],
      [18, [2.87, 1.26, -3.41, 0.0]],
      [19, [0.0, 3.0, 0.0, 0.0]],
      [20, [0.0, -2.04, 0.0, 0.0]],
      [21, [0.71, -3, 97, 0.0]],
      [22, [-1.81, 1.72, 1.18]],
      [23, [4.4, 0.0, -0.3]],
      [24, [0.0, -6.59, 0.0, 0.0]],
      [25, [0.0, 0.0, -6.59, 1.83]],
      [26, [0.0, 2.04, 0.0, 0.0]],
      [27, [-0.43, 3.7, 1.02, -2.82, 0.0]],
      [28, [-1.8, 0.0, 0.0]],
      [29, [2.09, 0.0, 0.0]],
      [30, [3.94, 0.0, 0.0]],
      [31, [2.16, 0.0, 0.0]],
      [32, [2.75, 0.0, 0.0]],
      [33, [3.79, -4.56, -3.97, 0.0, 0.0]],
      [34, [3.7, 3.7, 3.08, 0.69, 0.0, -2.45]],
      [35, [3.7, 0.0, 0.0, 1.71, 0.0, -0.47]],
      [36, [-3.2, 0.0]],
      [37, [1.76, 2.64, 0.0, 5.73, 0.47]],
      [38, [-0.14, 1.14, 1.76, 0.0, 0.0]],
      [39, [0.48, -3.02, 0.0, 1.3]],
    ]);
  }

  getTitle() {
    return "Опрос о яичниках";
  }
}
