import BaseSurveyStrategy from "../baseSurveyStrategy.js";
import Question from "../question.js";

export default class UterineBodySurvey extends BaseSurveyStrategy {
  constructor() {
    super();
    this.createQuestions();
    this.createScores();
  }

  createQuestions() {
    this.questions = new Map([
      [1, new Question("Место проживания:", ["Город", "Село"])],
      [
        2,
        new Question("Возраст:", [
          "20-29",
          "30-39",
          "40-49",
          "50-59",
          "60-69",
          "70+",
        ]),
      ],
      [3, new Question("Образование:", ["Высшее", "Среднее"])],
      [
        4,
        new Question("Профессия:", [
          "Учитель",
          "Домохозяйка",
          "Другая профессия",
        ]),
      ],
      [
        5,
        new Question("Семейное положение:", [
          "Не замужем",
          "замужем",
          "Вдова",
          "Разведенная",
        ]),
      ],
      [
        6,
        new Question("С какого возраста замужем:", [
          "до 18 лет",
          "до 24 лет",
          "с 25 лет и более",
        ]),
      ],
      [
        7,
        new Question("С какого возраста начались менструации:", [
          "Нет информации",
          "с 12–14 лет",
          "с 15-17 лет",
        ]),
      ],
      [
        8,
        new Question(
          "Жалобы (можно указать несколько вариантов):",
          [
            "Боли внизу живота",
            "Бели",
            "Кровотечение из половых путей",
            "Головокружение, слабость",
            "Отсутствие аппетита",
            "Другие",
          ],
          true
        ),
      ],
      [
        9,
        new Question("Тип менструации:", [
          "Идеальные",
          "Антепонирующие",
          "Постпонирующие",
          "Нерегулярные",
        ]),
      ],
      [
        10,
        new Question("Продолжительность менструаций:", [
          "Нормальная (3–6 дней)",
          "Длительная (более 6 дней)",
          "Короткая (до 2 дней)",
        ]),
      ],
      [
        11,
        new Question("Характер менструаций:", [
          "Умеренный",
          "Скудный",
          "Обильный",
        ]),
      ],
      [
        12,
        new Question("Ювенильные кровотечения:", [
          "Да",
          "Нет",
          "Нет информации",
        ]),
      ],
      [
        13,
        new Question("Аномальные кровотечения в перименопаузе:", ["Да", "Нет"]),
      ],
      [
        14,
        new Question("Кровянистые выделения в менопаузе:", [
          "Да",
          "Нет",
          "Нет менопаузы",
        ]),
      ],
      [
        15,
        new Question("Возраст наступления менопаузы:", [
          "До 45 лет",
          "До 50-59 лет",
          "нет менопаузы",
        ]),
      ],
      [
        16,
        new Question("Рост волос на лобке:", [
          "До 11 лет",
          "11-12 лет",
          "13–14 лет",
          "Нет информации",
        ]),
      ],
      [
        17,
        new Question("Рост волос в подмышечной области:", [
          "До 13 лет",
          "13-14 лет",
          "Старше",
          "Нет информации",
        ]),
      ],
      [
        18,
        new Question(
          "Отложение жировой ткани на бедрах и в передней брюшной стенке:",
          ["До 10 лет", "10-12 лет", "13-16 лет", "Нет информации"]
        ),
      ],
      [
        19,
        new Question("С какого возраста появилось либидо:", [
          "До 13 лет",
          "14-15 лет",
          "16 лет и старше",
          "нет информации",
        ]),
      ],
      [
        20,
        new Question("Характер либидо:", [
          "Нормальный",
          "Пониженный",
          "Повышенный",
          "Фригидность",
        ]),
      ],
      [21, new Question("Предохраняетесь от береености:", ["Да", "Нет"])],
      [
        22,
        new Question("Регулярность половой жизни:", [
          "Регулярная",
          "Нерегулярная",
        ]),
      ],
      [
        23,
        new Question("Количество беременностей:", [
          "До 2-х",
          "До 4-х",
          "5-9",
          "Более 10",
          "Не было родов",
        ]),
      ],
      [
        24,
        new Question("Возраст при первых родах:", [
          "До 18 лет",
          "До 30 лет",
          "Старше 30 лет",
          "Старше 40 лет",
        ]),
      ],
      [
        25,
        new Question("Количество абортов:", [
          "До 3-х",
          "4-5 абортов",
          "Более 5",
          "Не было абортов",
        ]),
      ],
      [
        26,
        new Question("Возраст при первом аборте:", [
          "До 18 лет",
          "19-30 лет",
          "Старше 30",
          "Нет информации",
        ]),
      ],
      [
        27,
        new Question("Рождение крупного плода (более 4000 г):", [
          "Да",
          "Нет",
          "Нет информации",
        ]),
      ],
      [28, new Question("Воспаление матки:", ["Да", "Нет", "Нет информации"])],
      [29, new Question("Миома матки:", ["Да", "Нет", "Нет информации"])],
      [
        30,
        new Question("Перенесенные гинекологические операции:", ["Да", "Нет"]),
      ],
      [31, new Question("Ожирение:", ["Да", "Нет", "Нет информации"])],
      [32, new Question("Диабет:", ["Да", "Нет", "Нет информации"])],
      [
        33,
        new Question("Гипертоническая болезнь:", [
          "Да",
          "Нет",
          "Нет информации",
        ]),
      ],
      [
        34,
        new Question(
          "Наличие злокачественных опухолей у родственников (1-й линии) (можно указать несколько вариантов):",
          [
            "Половые органы",
            "Легкие",
            "Молочные железы",
            "ЖКТ",
            "Нет информации",
          ],
          true
        ),
      ],
      [
        35,
        new Question(
          "Наличие злокачественных опухолей у родственников (2-й линии) (можно указать несколько вариантов):",
          ["Половые органы", "ЖКТ", "Нет информации"],
          true
        ),
      ],
      [
        36,
        new Question("Характер пищи:", [
          "Мясная",
          "Рыбная",
          "Растительная",
          "Молочная",
          "Смешанная",
        ]),
      ],
      [
        37,
        new Question(
          "Последствия психологической травмы (можно указать несколько вариантов):",
          [
            "Раздражительность",
            "Плаксивость",
            "Апатия",
            "Бессоница",
            "Другое",
            "Нет",
          ],
          true
        ),
      ],
      [
        38,
        new Question(
          "Состояние нервной системы (можно указать несколько вариантов):",
          [
            "Кратковременная потеря памяти",
            "Долговременная потеря памяти",
            "Когнитивные нарушения (умственные способности)",
            "Аффективные реакции (раздражительность, плаксивость, эмоциональная лабильность)",
            "Другое",
            "Нет",
          ],
          true
        ),
      ],
      [
        39,
        new Question(
          "Хронические болезни (можно указать несколько вариантов):",
          ["Гастрит", "Эндоцервицит", "Кольпит", "Другие", "Нет"],
          true
        ),
      ],
    ]);
  }

  createScores() {
    this.scores = new Map([
      [1, [-0.76, 0.61]],
      [2, [-7.29, 0.0, 1.59, 2.75, 3.44, 5.82]],
      [3, [0.0, 1.85]],
      [4, [-3.26, 2.12, 5.62]],
      [5, [0.0, 0.0, 2.02, 0.0]],
      [6, [2.82, -5.14, -2.82]],
      [7, [0.0, 0.62, 0.0]],
      [8, [1.11, -5.26, 2.97, -1.63, 3.07, 0.0]],
      [9, [-2.28, 0.0, 0.0, 3.12]],
      [10, [-1.4, 2.76, 0.0]],
      [11, [0.0, 0.0, 2.52]],
      [12, [3.15, 0.0, 0.0]],
      [13, [6.27, 0.0]],
      [14, [5.61, 0.0, 0.0]],
      [15, [5.14, 5, 72, -2.94]],
      [16, [0.0, 0.82, -1.09, 0.0]],
      [17, [0.0, 1.38, 0.0, 0.0]],
      [18, [0.0, 2.28, 1.24, 0.0]],
      [19, [2.34, 1.58, 0.0, 0.0]],
      [20, [-0.67, 3.02, 0.0, 0.0]],
      [21, [0.0, 0.62]],
      [22, [-1.62, 1.63]],
      [23, [-2.64, 0.0, 2.73, 5.26, 0.0]],
      [24, [2.6, -0.57, 0.0, 0.0]],
      [25, [0.0, 0.0, -5.68, 1.68]],
      [26, [0.0, 2.13, 0.0, 0.0]],
      [27, [1.68, 0.0, 0.0]],
      [28, [0.84, 0.0, 0.0]],
      [29, [3.48, 0.0, 0.0]],
      [30, [4.54, 0.0, 0.0]],
      [31, [4.21, 0.0, 0.0]],
      [32, [2.44, 0.0, 0.0]],
      [33, [4.73, 0.0, 0.0]],
      [34, [6.32, 5.44, 2.68, 0.92, -3.63]],
      [35, [6.32, 4.33, -4.56]],
      [36, [3.14, 4.13, 0.0, 0.0, -1.41]],
      [37, [0.64, 1.28, 0.46, 2.78, 0.0, 0.0]],
      [38, [0.52, -1.94, 1.49, 0.0, 0.0]],
      [39, [3.29, -3.99, -3.72, 0.0, 0.0]],
    ]);
  }

  getTitle() {
    return "Опрос о теле матки";
  }
}
